AtmatiAdi/UberDriver/v3.0 STM32F103/Uber v3 stm32f103/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define PWM_PRESC 1-1
#define PWM_PERIOD 640-1
#define ENGATE_Pin GPIO_PIN_0
#define ENGATE_GPIO_Port GPIOD
#define DEBUG_PIN_Pin GPIO_PIN_1
#define DEBUG_PIN_GPIO_Port GPIOD
#define ADC_VOLTAGE_DC_Pin GPIO_PIN_0
#define ADC_VOLTAGE_DC_GPIO_Port GPIOA
#define ADC_VOLTAGE_A_Pin GPIO_PIN_1
#define ADC_VOLTAGE_A_GPIO_Port GPIOA
#define ADC_VOLTAGE_B_Pin GPIO_PIN_2
#define ADC_VOLTAGE_B_GPIO_Port GPIOA
#define ADC_VOLTAGE_C_Pin GPIO_PIN_3
#define ADC_VOLTAGE_C_GPIO_Port GPIOA
#define ADC_CURRENT_C_Pin GPIO_PIN_4
#define ADC_CURRENT_C_GPIO_Port GPIOA
#define ADC_CURRENT_B_Pin GPIO_PIN_5
#define ADC_CURRENT_B_GPIO_Port GPIOA
#define ADC_CURRENT_A_Pin GPIO_PIN_6
#define ADC_CURRENT_A_GPIO_Port GPIOA
#define PWM_LC_Pin GPIO_PIN_7
#define PWM_LC_GPIO_Port GPIOA
#define PWM_LB_Pin GPIO_PIN_0
#define PWM_LB_GPIO_Port GPIOB
#define PWM_LA_Pin GPIO_PIN_1
#define PWM_LA_GPIO_Port GPIOB
#define HALL_C_Pin GPIO_PIN_2
#define HALL_C_GPIO_Port GPIOB
#define PWM_HC_Pin GPIO_PIN_8
#define PWM_HC_GPIO_Port GPIOA
#define PWM_HB_Pin GPIO_PIN_9
#define PWM_HB_GPIO_Port GPIOA
#define PWM_HA_Pin GPIO_PIN_10
#define PWM_HA_GPIO_Port GPIOA
#define HALL_B_Pin GPIO_PIN_11
#define HALL_B_GPIO_Port GPIOA
#define HALL_A_Pin GPIO_PIN_12
#define HALL_A_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
